function generatequotes(){
    var quotes={
        "- রবীন্দ্রনাথ ঠাকুর" : '“চিত্ত যেথা ভয়শূন্য, উচ্চ যেথা শির, জ্ঞান যেথা মুক্ত, যেথা গৃহের প্রাচীর আপন প্রাঙ্গণতলে দিবস শর্বরীব সুধারে রাখে নাই খন্ড ক্ষুদ্র করি।”',

        "- স্বামী বিবেকানন্দ " : '"যত মত তত পথ।"',

        "- মাইকেল জর্ডান " : '" আমি ব্যর্থতা কে মেনে নিতে পারি কিন্তু আমি চেষ্টা না করাকে মেনে নিতে পারিনা।  "',

        "- সক্রেটিস " : '" অন্যায় করে লজ্জিত না হওয়াটা আরেক অন্যায়।  "',

        "- রবি ঠাকুর " : '" চন্দ্রের যা কলঙ্ক সেটা কেবল মুখের উপরে, তার জ্যোৎস্নায় কোনো দাগ পড়ে না।   "',

        "- স্বামী বিবেকানন্দ " : '"চালাকির দ্বারা কোন মহৎ কাজ হয় না। "',

        "- শিখা পত্রিকা " : '" জ্ঞান যেখানে সীমাবদ্ধ, বুদ্ধি সেখানে আড়ষ্ট, মুক্তি সেখানে অসম্ভব  "'
    }
    var authors=Object.keys(quotes);
    var author=authors[Math.floor(Math.random()*authors.length)];
    var quote=quotes[author];
    document.getElementById("quote").innerHTML=quote;
    document.getElementById("author").innerHTML=author;


    
}